mutations/m51-decay-integer-seconds.diff
diff --git a/pkg/data/data.go b/pkg/data/data.go
index 4869c99..96d62a1 100644
--- a/pkg/data/data.go
+++ b/pkg/data/data.go
@@ -226,7 +226,7 @@ func generateNHashesUsing64Bit(input []byte, n uint32, seed uint32) []uint32 {
 // lambda: the decay rate (higher values mean faster decay)
 // deltaMs: the time difference in milliseconds
 func adjustProbability(prob float64, lambda float64, deltaMs uint64) float64 {
-	deltaSec := float64(deltaMs) / 1000.0
+	deltaSec := float64(deltaMs/1000)
 	decayedProb := prob * math.Exp(-lambda*deltaSec)
 
 	if decayedProb < 0 {
