mutations/m59-stats-index-obo.diff
diff --git a/pkg/data/data.go b/pkg/data/data.go
index 4869c99..2a2655b 100644
--- a/pkg/data/data.go
+++ b/pkg/data/data.go
@@ -101,7 +101,7 @@ func (s *Structure) RegisterRequest(_ context.Context, clientIdentifier []byte)
 					BucketIndexes: make([]int, s.config.L),
 				}
 			}
-			stats.BucketIndexes[l] = int(m)
+			stats.BucketIndexes[l] = int((m+1)%s.config.M)
 		}
 	})
 
