mutations/m63-skip-first-level.diff
diff --git a/pkg/data/data.go b/pkg/data/data.go
index 4869c99..edceed8 100644
--- a/pkg/data/data.go
+++ b/pkg/data/data.go
@@ -152,7 +152,7 @@ func (s *Structure) ReportOutcome(_ context.Context, clientIdentifier []byte, ou
 func (s *Structure) visitBuckets(clientIdentifier []byte, fn func(uint32, uint32, *bucket)) {
 	levelHashes := generateNHashesUsing64Bit(clientIdentifier, s.config.L, s.murmurSeed)
 
-	for l := 0; l < int(s.config.L); l++ {
+	for l := 1; l < int(s.config.L); l++ {
 		lvl := s.levels[l]
 		m := levelHashes[l] % s.config.M
 		buck := lvl[m]
