mutations/m70-nonzero-start-prob.diff
diff --git a/pkg/data/data.go b/pkg/data/data.go
index 4869c99..77b00e7 100644
--- a/pkg/data/data.go
+++ b/pkg/data/data.go
@@ -26,7 +26,7 @@ type bucket struct {
 
 func newBucket(clock utils.IClock) *bucket {
 	return &bucket{
-		probability:           0,
+		probability:           0.01,
 		lastUpdatedTimeMillis: uint64(clock.Now().UnixMilli()),
 		lock:                  &sync.Mutex{},
 	}
